print('Задача 6. Письмо')

# У нас есть
# квадратный конверт размера 12х12 сантиметров и письмо на квадратном листе бумаги,
# которое не помещается в конверт.
# 
# Напишите программу,
# которая подскажет сколько раз нужно сложить письмо пополам,
# чтобы оно поместилось в конверт.
# Размеры письма вводятся с клавиатуры.

pack_size = 12

letter_size = int(input('input letter size: '))

count = 0

while letter_size > pack_size:
    count += 2
    letter_size /= 2

print('result:', count)
